/***************18B20Œ¬∂»œ‘ æ ‘—È*****************/

#include<reg51.h>
#include"lcd.h"
#include"temp.h"

uchar table[]={'C'};
uchar table1[12]={"temperature:"};
void LcdDisplay(int);
sbit buzzer=P1^0;
sbit led=P1^6;
int i;
 void delay(unsigned int x)
{
    char y;
    for(x; x > 0; x--)
        for(y = 200; y > 0; y--);
}


/*******************UART()≥ı ºªØ¥Æø⁄*******************/

void UART()
{
	SCON=0X50;			//…Ë÷√Œ™π§◊˜∑Ω Ω1
	TMOD=0X20;			//…Ë÷√º∆ ˝∆˜π§◊˜∑Ω Ω2
	PCON=0X80;			//≤®Ãÿ¬ º”±∂
	TH1=0XF3;				//º∆ ˝∆˜≥ı º÷µ…Ë÷√£¨◊¢“‚≤®Ãÿ¬  «4800µƒ
	TL1=0XF3;
	ES=1;						//¥Úø™Ω” ’÷–∂œ
    EA=1;						//¥Úø™◊‹÷–∂œ
	TR1=1;					//¥Úø™º∆ ˝∆˜
}


void main()
{
 	led=0;
	buzzer=0;
	UART();
	LcdInit();			 //≥ı ºªØLCD1602
	LcdWriteCom(0x88);	 //–¥µÿ÷∑ 80±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('C');

	while(1)
	{
		LcdDisplay(Ds18b20ReadTemp());
		  if(Ds18b20ReadTemp()>350)
			{
			  led=1;
			  for(i=0;i<10;i--)		   //«˝∂ØŒﬁ‘¥∑‰√˘∆˜	 £¨–Ë“™∏¯∑‰√˘∆˜“ª∏ˆ≥÷–¯µƒ¬ˆ≥Â≤≈ø…“‘£¨º¥’‚∏ˆfor—≠ª∑
			   {
			   		 buzzer= 0;
					 delay(1);
					 buzzer= 1;
					 delay(1);	
				}	
 
			} 
       else {
		      led=0;   	 
		     } 

	}

}

/***************** LcdDisplay()LCDœ‘ æ∂¡»°µΩµƒŒ¬∂»*******************/

void LcdDisplay(int temp) 	 //lcdœ‘ æ
{
    
  	unsigned char i,  datas[] = {0, 0, 0, 0, 0}; //∂®“Â ˝◊È
	float tp;  
	if(temp< 0)				    //µ±Œ¬∂»÷µŒ™∏∫ ˝
  	{
	  	LcdWriteCom(0x80);		//–¥µÿ÷∑ 80±Ì æ≥ı ºµÿ÷∑
		SBUF='-';               //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
		while(!TI);			         //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
		TI=0;						 //«Â≥˝∑¢ÀÕÕÍ≥…±Í÷æŒª
	    LcdWriteData('-');  	     //œ‘ æ∏∫
		//“ÚŒ™∂¡»°µƒŒ¬∂» « µº Œ¬∂»µƒ≤π¬Î£¨À˘“‘ºı1£¨‘Ÿ»°∑¥«Û≥ˆ‘≠¬Î
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//¡Ù¡Ω∏ˆ–° ˝µ„æÕ*100£¨+0.5 «Àƒ…·ŒÂ»Î£¨“ÚŒ™C”Ô—‘∏°µ„ ˝◊™ªªŒ™’˚–Õµƒ ±∫Ú∞—–° ˝µ„
		//∫Û√Êµƒ ˝◊‘∂Ø»•µÙ£¨≤ªπ‹ «∑Ò¥Û”⁄0.5£¨∂¯+0.5÷Æ∫Û¥Û”⁄0.5µƒæÕ «Ω¯1¡À£¨–°”⁄0.5µƒæÕ
		//À„”…œ0.5£¨ªπ «‘⁄–° ˝µ„∫Û√Ê°£
 
  	}
 	else
  	{			
	  	
		tp=temp;//“ÚŒ™ ˝æ›¥¶¿Ì”––° ˝µ„À˘“‘Ω´Œ¬∂»∏≥∏¯“ª∏ˆ∏°µ„–Õ±‰¡ø
		//»Áπ˚Œ¬∂» «’˝µƒƒ«√¥£¨ƒ«√¥’˝ ˝µƒ‘≠¬ÎæÕ «≤π¬ÎÀ¸±æ…Ì
		temp=tp*0.0625*100+0.5;	
		//¡Ù¡Ω∏ˆ–° ˝µ„æÕ*100£¨+0.5 «Àƒ…·ŒÂ»Î£¨“ÚŒ™C”Ô—‘∏°µ„ ˝◊™ªªŒ™’˚–Õµƒ ±∫Ú∞—–° ˝µ„
		//∫Û√Êµƒ ˝◊‘∂Ø»•µÙ£¨≤ªπ‹ «∑Ò¥Û”⁄0.5£¨∂¯+0.5÷Æ∫Û¥Û”⁄0.5µƒæÕ «Ω¯1¡À£¨–°”⁄0.5µƒæÕ
		//À„º”…œ0.5£¨ªπ «‘⁄–° ˝µ„∫Û√Ê°£
	}
	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
	datas[3] = temp % 100 / 10;
	datas[4] = temp % 10;
	LcdWriteCom(0x80);
	 for(i=0;i<12;i++)
	  {
	   LcdWriteData(table1[i]);
	   SBUF=table1[i];
	   while(!TI);	        //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	   TI=0;
	  
	  }
	LcdWriteCom(0x80+0x40);		//–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
    LcdWriteData('+'); 		//œ‘ æ’˝
    SBUF='+';//Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while(!TI);			         //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI=0;						 //«Â≥˝∑¢ÀÕÕÍ≥…±Í÷æŒª
	LcdWriteCom(0x80+0x40+0x02);		    //–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('0'+datas[0]); //∞ŸŒª 
	SBUF = '0'+datas[0];        //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			    //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;
	
	LcdWriteCom(0x80+0x40+0x03);		    //–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('0'+datas[1]); // ÆŒª
	SBUF = '0'+datas[1];        //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			    //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;

	LcdWriteCom(0x80+0x40+0x04);		    //–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('0'+datas[2]); //∏ˆŒª 
	SBUF = '0'+datas[2];        //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			    //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;

	LcdWriteCom(0x80+0x40+0x05);		//–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('.'); 		//œ‘ æ °Æ.°Ø
	SBUF = '.';             //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			//µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;

	LcdWriteCom(0x80+0x40+0x06);		    //–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('0'+datas[3]); //œ‘ æ–° ˝µ„  
	SBUF = '0'+datas[3];        //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			    //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;

	LcdWriteCom(0x80+0x40+0x07);		    //–¥µÿ÷∑ ±Ì æ≥ı ºµÿ÷∑
	LcdWriteData('0'+datas[4]); //œ‘ æ–° ˝µ„ 
	SBUF = '0'+datas[4];        //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
	while (!TI);			    //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
	TI = 0;
	LcdWriteCom(0x80+0x40+0x09);
    for(i=0;i<1;i++)
	   {
	    LcdWriteData(table[i]);	
		SBUF=table[i];       //Ω´Ω” ’µΩµƒ ˝æ›∑≈»ÎµΩ∑¢ÀÕºƒ¥Ê∆˜
		while(!TI);	        //µ»¥˝∑¢ÀÕ ˝æ›ÕÍ≥…
		TI=0;
	   }
	 

}




	

	 
